read_verilog -sv -formal -overwrite {workspace}/ProyectoFinal.srcs/sources_1/new/edaplayground.v
design -reset-vlog; proc;
write_json {workspace}/netlist/controller.json